run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/capillaryGorterMellink/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
//dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet      
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

	symmetryPlane
	{
		type  symmetryPlane;
	}

    outlet      
    {
//		type			advective;
        type            fixedValue;
		value			uniform 0; 
    }

    fixedWalls      
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
