run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/capillaryGorterMellink/0/Un
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Un;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    inlet      
    {
        type            superFluidWallUn;
		value			uniform (0 0 0);
    }

	symmetryPlane
	{
		type  symmetryPlane;
	}

    outlet      
    {
        type            zeroGradient;
/*
		type directionMixed;
		refValue uniform (0 0 0);
		refGradient uniform (0 0 0);
		valueFraction uniform (0 0 0 1 0 1);
*/

    }

    fixedWalls      
    {
        type            superFluidWallUn;
		value			uniform (0 0 0);
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
