run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/capillaryGorterMellink/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha 0
);

regions
(
    boxToCell
    {
//        box (0 0 0) (0.0004 0.001 0.0001);
        box (0 0 0) (0.0004 0.001 0.0001);
        fieldValues
        (
            volScalarFieldValue alpha 1
        );
    }
);


// ************************************************************************* //
